package cn.xxx.nettyhttp.service;

import java.util.Random;

/**
 * @author lzhh
 * @date 2019/7/13 16:01
 * 类说明:http响应报文体
 */
public class RespConstant {
    private static final String [] NEWS ={ "这一次分手，离去的是男子，送行的是女子，她的身份当是娼妓。女的不让男的走，男的执意要走，有了分歧，产生了矛盾，难免有点不愉快。女方“留人不住”，这才饯别已罢，来到渡头送别。这场离别，不只是依恋难舍，更夹杂着抑郁、哀怨以及负气、委屈等等复杂的情绪。此词是从女方的角度落笔，是代她立言，故而她的形象得到了充分的刻画，心情、语气都描摹得活灵活现。作者抓住了一个“怨”字，这个字贯串全篇，成为了叙事、抒情、写景。最终归总到刻画人物的一个基调。\n" +
            "“留人不住，醉解兰舟去”，开头两句交代了此番送别的缘由和双方的心态。留不住，是结果，此前经过、细节当有种种多多，恐怕是表述不完，也表述不清的，故而也就毋须表述了。显然是女方迫不得已作了让步，才允许男子离去的，但她仍然不能心平气和，分手之际，心里怕是涌上了种种滋味。“醉”字点出了沉闷的饯别酒筵，行者送者各怀心事，佳肴美酒还有什么味道。尽管闷酒醉人，男子亦不推延行期，可见其去意之坚决与急切。这一点，自然也增加了女子的怨意。所以，“醉解兰舟”里面也是有文章的。\n" +
            "“一棹碧涛春水路，过尽晓莺啼处。”这两句与柳永《雨霖铃》词中的名句“今宵酒醒何处，杨柳岸，晓风残月”比较起来，表面上虽有近似之处，实际上却是很不相同的语气和心情。二句紧承“醉解兰舟去”，写的是春晨江景，也是女子揣想情人一路上所经的风光。江中是碧绿的春水，江上有婉转的莺歌，是那样的宜人。当然，景色的美好只是女子的想象，或许更是她的期望，即使他决然地离开了她，她也仍旧希望自己的情人在路上有美景相伴，可见痴情至深。“过尽”两个字，暗示女子与恋人天各一方的事实，含蓄透露出她的忧伤。\n" +
            "“渡头杨柳青青，枝枝叶叶离情。”情人已经走了很久，不见踪影，但女子依旧站在那里。堤边杨柳青青，枝叶茂盛繁多，千丝万缕，依依有情，它们与女子一起伫立于渡口，安静凝望远方。古人有折柳枝送别的习俗，所以“枝枝叶叶”含有离情的意思，此处即借杨柳的枝叶来暗示女子黯然的离情。\n" +
            "“此后锦书休寄，画楼云雨无凭。”这两句所表达的感情非常激烈。女子负气道：“我们青楼女子是靠不住的，你今后不必来信了，从此割断情感联系吧。”“画楼云雨”四个字道出了女子与男子曾经的美好过往，只可惜男子决然绝情。相守的期盼落空之后，她只有怀着无限的怨恨选择放弃，从特意提及“锦书”可知，女子内心并不想如此决绝，只是无可奈何罢了。她实际的所作所为，已经充分说明了她不愧是一个多情的女子，但是，话必须这么说，词必须这么写，才能把她的性格展现出来。\n" +
            "这首词在技巧上运用了很多对比方法：一个苦苦挽留，一个“醉解兰舟”；一个“一棹碧涛”、晓莺轻啼，一个独立津渡、满怀离情；一个意浅，一个情深，让人一目了然。在结构上，亦是先含情脉脉，后决绝断念。结尾二句虽似负气怨恨，但正因为爱得执著，才会有如此烦恼，所以更能反衬出词人的一片痴情。总之，此词刻画细腻，惟妙惟肖地表现出一个女子痴中含怨的微妙心理。\n" +
            "封建社会里，妇女的社会地位低下。穷人家的女孩子，命运尤其悲惨。她们有的因生活没有着落，或被父母卖掉，或被他人拐骗，有的沦落到秦楼楚馆，便成了被人玩弄的对象。她们有的虽然追求理想，响往真挚幸福的爱情生活，但这些往往成为泡影。这首词将目光投向了这些可怜的女子，在客观上有一定的认识意义。\n" +
            "清平乐·留人不住" +
            "\n" +
            " \n" +
            "《木兰花·秋千院落重帘暮》由晏几道创作，被选入《宋词三百首》。这是一首描写恋情的词。上阕写别后回想以前闲来绣户彩笔题诗，突出文字姻缘。现在恐怕欢尽人散，庭院冷落，暗写别离：墙内之人如雨后杏花，墙外之人似风后柳絮，沦落凄迷，情意缠绵。下阕写对佳人的深深怀念。“朝云”两句以楚王游高唐与神女欢洽的神话，写与恋人离别后音讯全无，只有凭春梦相见了。最后二句又更进一层，说自己的马尚能记得恋人的住处，从“画桥东畔路”上经过时，竟长嘶而鸣。全词虚实相生，幻境与实境完美融合，极具浪漫主义色彩，意境优美。\n" +
            "晏几道早年常与诗朋酒友、歌儿舞女聚会游冶，后来时过景迁，故人星散，词人脑海中保留了一桩桩美好的记忆。该篇即为重游故地、追怀旧友而作。"
    };
    private static final Random R = new Random();
    public static String getNews(){
        return NEWS[R.nextInt(NEWS.length)];
    }
}
